backend/app/controllers/api/v1/notes_controller.rb

SELECT "notes".* FROM "notes"
---
  def index
    notes = Note.all

INSERT INTO "notes" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sdafv"], ["body", ""], ["created_at", "2018-01-17 19:05:32.845744"], ["updated_at", "2018-01-17 19:05:32.845744"]]
---
  def create
    note = Note.create(note_params)

UPDATE "notes" SET "body" = ?, "title" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["body", "whattup"], ["title", "some note"], ["updated_at", "2018-01-17 19:51:00.697276"], ["id", 24]]
---
  def update
    @note.update(note_params)

DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 24]]
---
  def destroy
    noteId = @note.id
    @note.destroy